In [166]:
1+1

2

# 시작하기
## 이게 안되네
#### 아나콘다..
- 이자식

In [167]:
123e5

12300000.0

In [168]:
a = "\"Python\" is awesome \nand I also 시. 험. 시. 러."
print(a)

"Python" is awesome
and I also 시. 험. 시. 러.

In [169]:
'abc'
"abc"
'''abc'''
"""abc"""

'abc'

In [170]:
print('abc')
print("abc")
print('''abc''')
print("""abc""")

abc
abc
abc
abc

In [171]:
"it's mine"
'''it's mine'''

"it's mine"

In [172]:
tx = "Hello"
print(tx[0])
print(tx[-1])
print(tx[0:3])
print(tx[:3])

H
o
Hel
Hel

In [173]:
print(2 ** 4)
print(5/3)
print(5//3)
print((1 - 0.01) ** 100)

16
1.6666666666666667
1
0.3660323412732292

In [174]:
print([1,2,3], ["a,b"])

[1, 2, 3] ['a,b']

In [175]:
aa = [1, 2, 3]
print(aa[0])
bb = [1, 2, ["a", "b"]]
print(bb[2][0])

1
a

In [176]:
kk = [100, 200, 300]
kk.index(200)

1

In [177]:
# 튜플 내부의 리스트는 수정 가능하다
print((1,2,3))
aa = (1,2,[5,6,7])
aa[2][2]=2
aa

(1, 2, 3)

(1, 2, [5, 6, 2])

In [178]:
dic = {"k1":1, "k2":"aa"}
dic.get("k1")

1

In [179]:
aa = "asdf"
aa.upper()

'ASDF'

In [180]:
num = "010-1234-1234"
num.split("-")

['010', '1234', '1234']

In [181]:
"+".join(["x1", "x2"])

'x1+x2'

In [182]:
True + False

1

In [183]:
4 > 2

True

In [184]:
if True:
    print(123)

123

In [185]:
if False:
    print(123)

In [186]:
value = 100
if value >= 50:
    print("up")

up

In [187]:
value = 100
if value <= 50:
    print("up")
else :
    print("down")

down

In [188]:
level = ["A", "B", "C"]
mine = "C"
if mine in level[:1]:
    print("pass")
elif mine in level[:3]:
    print("Retake")
else:
    print("Fail")

Retake

In [189]:
level

['A', 'B', 'C']

In [190]:
level[1:2]

['B']

In [191]:
from tqdm.notebook import tqdm
import time

#프로그레스바
for char in tqdm(["a", "b", "c", "d"]):
    print(char)
    time.sleep(2)

  0%|          | 0/4 [00:00<?, ?it/s]

a
b
c
d

In [192]:
a = [2, 6, 7, 8]
listt = []
for num in a:
    if num % 2 == 0:
        listt = listt + [num]
listt

[2, 6, 8]

In [193]:
def udf_01(a):
    print(a)

In [194]:
udf_01("^^ㅣ발 시험시러")

^^ㅣ발 시험시러

In [195]:
def udf_02(aa = 2):
    print(aa)

In [196]:
udf_02(aa = 100)

100

In [197]:
udf_02()

2

In [198]:
def udf_mean(a):
    res = sum(a)/len(a)
    return res

udf_mean([1,2,3,4,5])

3.0

In [2]:
import os
import pandas as pd
os.listdir()

['.ipynb_checkpoints',
 'archive',
 'class_211025.ipynb',
 'DS_lv1',
 'python_class',
 'Untitled.ipynb']

In [3]:
folder = "archive"
list_files = os.listdir(folder)

# 폴더에 있는 모든 파일의 데이터를 빈 데이터프레임인 df_bind에 이어붙임
df_bind = pd.DataFrame()
for file in list_files:
    file_path = folder + "/" + file
    print(file_path)
    df_sub = pd.read_csv(file_path)
    df_bind = pd.concat([df_bind, df_sub])

len(df_bind)

archive/audi.csv
archive/bmw.csv
archive/cclass.csv
archive/focus.csv
archive/ford.csv
archive/hyundi.csv
archive/merc.csv
archive/skoda.csv
archive/toyota.csv
archive/unclean cclass.csv
archive/unclean focus.csv
archive/vauxhall.csv
archive/vw.csv

118150

In [4]:
df_bind.head()

,model,year,price,transmission,mileage,fuelType,tax,mpg,engineSize,tax(£),fuel type,engine size,mileage2,fuel type2,engine size2,reference
0,A1,2017.0,12500,Manual,15735,Petrol,150.0,55.4,1.4,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,A6,2016.0,16500,Automatic,36203,Diesel,20.0,64.2,2.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,A1,2016.0,11000,Manual,29946,Petrol,30.0,55.4,1.4,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,A4,2017.0,16800,Automatic,25952,Diesel,145.0,67.3,2.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,A3,2019.0,17300,Manual,1998,Petrol,145.0,49.6,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [5]:
os.getcwd()

'C:\\Users\\psk\\multicampus'

In [6]:
aws1 = pd.read_csv("DS_lv1\AWS_sample.txt", sep = "#")
aws1.head(2)

   AWS_ID             TM    TA  Wind X.
0     108  2016-07-01 00  24.2   2.3  =
1     108  2016-07-01 01  24.3   2.3  =

In [7]:
iris = pd.read_excel("DS_lv1\iris_xlsx.xlsx")
iris.head(2)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

In [8]:
# csv 경로입력할땐 /로 구분해야 하는건가봄?
# excel은 \든 /든 상관없음
bike = pd.read_csv("DS_lv1/bike.csv")
bike.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

In [9]:
bike["temp"].max()

41.0

In [10]:
bike["temp"].min()

0.82

In [11]:
bike["atemp"].max()

45.455

In [12]:
bike["atemp"].min()

0.76

In [13]:
bike[["temp", "atemp"]].max()

temp     41.000
atemp    45.455
dtype: float64

In [14]:
bike[["temp", "atemp"]].mean()

temp     20.230860
atemp    23.655084
dtype: float64

In [15]:
bike.loc[:, ["temp", "atemp"]].mean()

temp     20.230860
atemp    23.655084
dtype: float64

In [16]:
bike.loc[:3, ["temp", "atemp"]]

   temp   atemp
0  9.84  14.395
1  9.02  13.635
2  9.02  13.635
3  9.84  14.395

In [17]:
bike["season"].unique() # 중복제거(고유한 원소)

array([1, 2, 3, 4], dtype=int64)

In [18]:
bike["season"].nunique() # 고유한 원소의 개수 (number of unique elements)

4

In [19]:
bike["season"].value_counts() # 각 고유한 원소의 등장 빈도

4    2734
2    2733
3    2733
1    2686
Name: season, dtype: int64

In [20]:
bike["season"].value_counts(normalize = True) # 각 고유한 원소의 등장 비율

4    0.251148
2    0.251056
3    0.251056
1    0.246739
Name: season, dtype: float64

In [21]:
bike["season"].value_counts(normalize = True).round(3) # + 소수점 셋째 자리까지 반올림

4    0.251
2    0.251
3    0.251
1    0.247
Name: season, dtype: float64

In [22]:
bike["temp"] >= 20

0        False
1        False
2        False
3        False
4        False
         ...
10881    False
10882    False
10883    False
10884    False
10885    False
Name: temp, Length: 10886, dtype: bool

In [23]:
sum(bike["temp"] >= 20) # True를 1로 계산하기 때문에 True 개수를 세는 것과 같음.

5578

In [24]:
bike_temp_up20 = bike[bike["temp"] >= 20] # <-- 권장 x
bike_temp_up20.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
746,2011-02-14 11:00:00,1,0,1,1,21.32,25.000,23,16.9979,10,43,53
747,2011-02-14 12:00:00,1,0,1,1,22.96,26.515,22,30.0026,27,99,126

In [25]:
bike["temp"].quantile(0.01) # 제 1 백분위수(하위 1%)

4.92

In [26]:
# 사분위 범위(3Q - 1Q)
bike["temp"].quantile(0.75) - bike["temp"].quantile(0.25)

12.299999999999999

In [27]:
ser1 = pd.Series([1, 2, pd.NA, 3])
ser1

0       1
1       2
2    <NA>
3       3
dtype: object

In [28]:
import numpy as np
ser2 = pd.Series([2, 4, 6, np.nan, 10])
ser2

0     2.0
1     4.0
2     6.0
3     NaN
4    10.0
dtype: float64

In [29]:
ser1[ser1.notna()]

0    1
1    2
3    3
dtype: object

In [30]:
ser1_notna = ser1[ser1.notna()]
ser1_notna

0    1
1    2
3    3
dtype: object

In [31]:
ser1.fillna(111)
ser1

0       1
1       2
2    <NA>
3       3
dtype: object

In [32]:
df = pd.read_csv("DS_lv1/iris_missing.csv")
df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

# Q1. Sepal.Length의 결측치 개수

# Q2. df 객체의 결측치 개수 총합

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  143 non-null    float64
 1   Sepal.Width   137 non-null    float64
 2   Petal.Length  136 non-null    float64
 3   Petal.Width   144 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [34]:
len(df) - sum(df["Sepal.Length"] >= 1)

7

In [35]:
sum(df.isna().sum())

40

In [36]:
# df.iloc[:,n]  : n번째 열의 전체 행

df_na = pd.DataFrame()
for n in range(df.shape[1]):
    df.iloc[:,n].isna().sum()
    df_na_sub = pd.DataFrame({"column":[df.columns[n]],
                             "na_count":[df.iloc[:,n].isna().sum()]})
    df_na = pd.concat([df_na, df_na_sub])
    
df_na

         column  na_count
0  Sepal.Length         7
0   Sepal.Width        13
0  Petal.Length        14
0   Petal.Width         6
0       Species         0

In [37]:
df.head(10)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           NaN          NaN           NaN          NaN  setosa
7           5.0          3.4           NaN          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa
9           4.9          3.1           NaN          0.1  setosa

In [38]:
df_10 = df.iloc[:10, :-1] #마지막 변수를 제외
df_10

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
0           5.1          NaN           NaN          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2
5           5.4          3.9           1.7          0.4
6           NaN          NaN           NaN          NaN
7           5.0          3.4           NaN          0.2
8           4.4          2.9           1.4          0.2
9           4.9          3.1           NaN          0.1

In [39]:
df_10.dropna()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2
5           5.4          3.9           1.7          0.4
8           4.4          2.9           1.4          0.2

In [40]:
df_10.dropna(how="all")

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
0           5.1          NaN           NaN          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2
5           5.4          3.9           1.7          0.4
7           5.0          3.4           NaN          0.2
8           4.4          2.9           1.4          0.2
9           4.9          3.1           NaN          0.1

In [41]:
df_10 = df_10.fillna(-999)
df_10

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
0           5.1       -999.0        -999.0          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2
5           5.4          3.9           1.7          0.4
6        -999.0       -999.0        -999.0       -999.0
7           5.0          3.4        -999.0          0.2
8           4.4          2.9           1.4          0.2
9           4.9          3.1        -999.0          0.1

In [42]:
df_test = pd.DataFrame({"aa" : {1:7, 2:8, 3:9}, "bb" : {1:4, 2:5, 3:6}})
print(df_test)
df_test["aa"][1:3] # 배열처럼 데이터프레임 가져오기(aa 열의 1번째 행부터 3(-1)번째 행까지)

   aa  bb
1   7   4
2   8   5
3   9   6

2    8
3    9
Name: aa, dtype: int64

In [43]:
# 결측치가 있어도 평균은 제대로 나옴
df["Sepal.Length"].mean()

5.853846153846154

In [44]:
# 결측치를 평균값으로 채우기
df.loc[df["Sepal.Length"].isna(), "Sepal.Length"] = df["Sepal.Length"].mean()
df

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0        5.100000          NaN           NaN          0.2     setosa
1        4.900000          3.0           1.4          0.2     setosa
2        4.700000          3.2           1.3          0.2     setosa
3        4.600000          3.1           1.5          0.2     setosa
4        5.000000          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145      6.700000          3.0           5.2          2.3  virginica
146      5.853846          2.5           NaN          NaN  virginica
147      6.500000          3.0           5.2          2.0  virginica
148      6.200000          3.4           5.4          2.3  virginica
149      5.900000          3.0           5.1          NaN  virginica

[150 rows x 5 columns]

In [45]:
audi = pd.read_csv("archive/audi.csv")
audi.head()

  model  year  price transmission  mileage fuelType  tax   mpg  engineSize
0    A1  2017  12500       Manual    15735   Petrol  150  55.4         1.4
1    A6  2016  16500    Automatic    36203   Diesel   20  64.2         2.0
2    A1  2016  11000       Manual    29946   Petrol   30  55.4         1.4
3    A4  2017  16800    Automatic    25952   Diesel  145  67.3         2.0
4    A3  2019  17300       Manual     1998   Petrol  145  49.6         1.0

In [46]:
audi_asc = audi.sort_values("price", ascending = True) # 디폴트가 True임
audi_asc.head()

      model  year  price transmission  mileage fuelType  tax   mpg  engineSize
10588    A3  2003   1490    Automatic   101000   Diesel  240  44.5         1.9
10552    A4  2004   1699       Manual   110000   Diesel  315  36.2         2.5
7795     A3  2005   1975       Manual   104000   Petrol  240  38.1         2.0
10108    TT  2002   1990       Manual   131925   Petrol  325  30.1         1.8
7404     A3  2009   2490       Manual   152034   Diesel  150  55.4         1.9

In [47]:
audi["idx_pm"] = audi["price"] / audi["mileage"]
audi.head(2)

,model,year,price,transmission,mileage,fuelType,tax,mpg,engineSize,idx_pm
0,A1,2017,12500,Manual,15735,Petrol,150,55.4,1.4,0.794407
1,A6,2016,16500,Automatic,36203,Diesel,20,64.2,2.0,0.455763

# Q1. year는 차량 생산년도를 뜻한다. 연도별 차량생산 대수는?

# Q2. 어떤 모델의 차량이 가장 많은가? 해당 모델의 비중을 반올림하여 소수점 첫째 자리까지 출력하시오.

# Q3. 세금(tax)은 차량 거래가격(price)에 비례해 붙는다고 한다. 차량 거래가격 대비 평균 세금의 비율은?

In [56]:
# value_counts()로 출력된걸 바로 데이터프레임에 넣음. index는 초기화하고 열 이름 따로 설정해줌
audi_year_count = audi["year"].value_counts().reset_index()
audi_year_count.columns = ["year", "count"]
audi_year_count

    year  count
0   2019   3197
1   2016   1964
2   2017   1935
3   2015    999
4   2018    864
5   2020    716
6   2014    447
7   2013    291
8   2012     85
9   2011     47
10  2010     32
11  2009     23
12  2008     21
13  2007     16
14  2006      9
15  2005      7
16  2003      6
17  2004      5
18  2002      2
19  1998      1
20  1997      1

In [49]:
round(max(audi["model"].value_counts() / len(audi)),1)

0.2

In [50]:
audi["price"].mean() / audi["tax"].mean()

181.7032307017087

In [57]:
audi_sub1 = audi.sample(n = 4)
audi_sub1

,model,year,price,transmission,mileage,fuelType,tax,mpg,engineSize,idx_pm
2711,Q3,2019,28192,Semi-Auto,3161,Petrol,145,38.2,1.5,8.918697
10575,A4,2014,14000,Automatic,17803,Petrol,200,42.2,2.0,0.786384
2890,A4,2018,18995,Semi-Auto,18696,Petrol,145,50.4,1.4,1.015993
4021,Q2,2019,22990,Semi-Auto,18413,Petrol,145,40.9,1.5,1.248574

In [60]:
bike = pd.read_csv("DS_lv1/bike.csv")
bike.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

In [61]:
ser = pd.Series([1,2,3,4])
ser

0    1
1    2
2    3
3    4
dtype: int64

In [64]:
import numpy as np
df_1 = df.head()
df_2 = df.tail()
df_bind = pd.concat([df_1, df_2])
df_bind

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0        5.100000          NaN           NaN          0.2     setosa
1        4.900000          3.0           1.4          0.2     setosa
2        4.700000          3.2           1.3          0.2     setosa
3        4.600000          3.1           1.5          0.2     setosa
4        5.000000          3.6           1.4          0.2     setosa
145      6.700000          3.0           5.2          2.3  virginica
146      5.853846          2.5           NaN          NaN  virginica
147      6.500000          3.0           5.2          2.0  virginica
148      6.200000          3.4           5.4          2.3  virginica
149      5.900000          3.0           5.1          NaN  virginica

In [66]:
df_bind.shape

(10, 5)

In [68]:
pd.concat([df_1, df_2], axis = 1)

,Sepal.Length,Sepal.Width,Petal.Length,Petal.Width,Species,Sepal.Length,Sepal.Width,Petal.Length,Petal.Width,Species
0,5.1,NaN,NaN,0.2,setosa,NaN,NaN,NaN,NaN,NaN
1,4.9,3.0,1.4,0.2,setosa,NaN,NaN,NaN,NaN,NaN
2,4.7,3.2,1.3,0.2,setosa,NaN,NaN,NaN,NaN,NaN
3,4.6,3.1,1.5,0.2,setosa,NaN,NaN,NaN,NaN,NaN
4,5.0,3.6,1.4,0.2,setosa,NaN,NaN,NaN,NaN,NaN
145,NaN,NaN,NaN,NaN,NaN,6.700000,3.0,5.2,2.3,virginica
146,NaN,NaN,NaN,NaN,NaN,5.853846,2.5,NaN,NaN,virginica
147,NaN,NaN,NaN,NaN,NaN,6.500000,3.0,5.2,2.0,virginica
148,NaN,NaN,NaN,NaN,NaN,6.200000,3.4,5.4,2.3,virginica
149,NaN,NaN,NaN,NaN,NaN,5.900000,3.0,5.1,NaN,virginica

In [69]:
pd.concat([df_1, df_2.reset_index(drop = True)], axis = 1)

,Sepal.Length,Sepal.Width,Petal.Length,Petal.Width,Species,Sepal.Length,Sepal.Width,Petal.Length,Petal.Width,Species
0,5.1,NaN,NaN,0.2,setosa,6.700000,3.0,5.2,2.3,virginica
1,4.9,3.0,1.4,0.2,setosa,5.853846,2.5,NaN,NaN,virginica
2,4.7,3.2,1.3,0.2,setosa,6.500000,3.0,5.2,2.0,virginica
3,4.6,3.1,1.5,0.2,setosa,6.200000,3.4,5.4,2.3,virginica
4,5.0,3.6,1.4,0.2,setosa,5.900000,3.0,5.1,NaN,virginica

In [71]:
bank = pd. read_csv("DS_lv1/bank.csv", sep = ";")
bank.head(2)

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no

In [72]:
bank.groupby("job")["balance"].mean()

job
admin.           1226.736402
blue-collar      1085.161734
entrepreneur     1645.125000
housemaid        2083.803571
management       1766.928793
retired          2319.191304
self-employed    1392.409836
services         1103.956835
student          1543.821429
technician       1330.996094
unemployed       1089.421875
unknown          1501.710526
Name: balance, dtype: float64

In [73]:
bank.groupby("job")["balance"].mean().reset_index()

              job      balance
0          admin.  1226.736402
1     blue-collar  1085.161734
2    entrepreneur  1645.125000
3       housemaid  2083.803571
4      management  1766.928793
5         retired  2319.191304
6   self-employed  1392.409836
7        services  1103.956835
8         student  1543.821429
9      technician  1330.996094
10     unemployed  1089.421875
11        unknown  1501.710526

In [74]:
bank.groupby(["job","marital"])["balance"].mean().reset_index()

              job   marital      balance
0          admin.  divorced   977.811594
1          admin.   married  1353.266917
2          admin.    single  1111.482517
3     blue-collar  divorced   744.797468
4     blue-collar   married  1064.360750
5     blue-collar    single  1322.540230
6    entrepreneur  divorced   889.750000
7    entrepreneur   married  1612.825758
8    entrepreneur    single  2462.600000
9       housemaid  divorced  1166.230769
10      housemaid   married  1759.464286
11      housemaid    single  4695.333333
12     management  divorced  1432.352941
13     management   married  1858.082585
14     management    single  1729.529010
15        retired  divorced  1771.465116
16        retired   married  2383.857955
17        retired    single  3425.636364
18  self-employed  divorced  2572.066667
19  self-employed   married  1350.944882
20  self-employed    single  1089.268293
21       services  divorced   931.564516
22       services   married  1228.025424
23       services    single   947.722689
24        student   married   468.300000
25        student    single  1689.162162
26     technician  divorced   845.786517
27     technician   married  1436.919708
28     technician    single  1329.686567
29     unemployed  divorced   842.909091
30     unemployed   married  1131.586667
31     unemployed    single  1162.354839
32        unknown  divorced   137.000000
33        unknown   married  1275.933333
34        unknown    single  2664.285714

In [76]:
ser_time = pd.Series(["2021-10-26", "2021-10-27"])
ser_time

0    2021-10-26
1    2021-10-27
dtype: object

In [77]:
pd.to_datetime(ser_time)

0   2021-10-26
1   2021-10-27
dtype: datetime64[ns]

In [79]:
ser_time2 = pd.Series(["2021년 10월 26일", "2021년 10월 27일"])
ser_time2

0    2021년 10월 26일
1    2021년 10월 27일
dtype: object

In [81]:
# pd.to_datetime(ser_time2) :오류
pd.to_datetime(ser_time2, format = "%Y년 %m월 %d일")

0   2021-10-26
1   2021-10-27
dtype: datetime64[ns]

In [82]:
pd.to_datetime(pd.Series([1,2,]))

0   1970-01-01 00:00:00.000000001
1   1970-01-01 00:00:00.000000002
dtype: datetime64[ns]

In [84]:
ser = pd.to_datetime(pd.Series([1,2,10000,40000,45000]), unit = "D", origin="1970-01-01")
ser

0   1970-01-02
1   1970-01-03
2   1997-05-19
3   2079-07-08
4   2093-03-16
dtype: datetime64[ns]

In [85]:
ser.dt.year

0    1970
1    1970
2    1997
3    2079
4    2093
dtype: int64

In [86]:
ser.dt.month

0    1
1    1
2    5
3    7
4    3
dtype: int64

In [87]:
ser.dt.day

0     2
1     3
2    19
3     8
4    16
dtype: int64

# Q1. datetime 변수를 문자형에서 시간형식으로 변환하시오
##### pd.to_datetime()

# Q2. 년/월/일/요일 변수를 각각 year/month/day/wday 변수로 bike_sub 객체에 생성하시오.

# Q3. 월별 casual의 총합을 산출하여 DataFrame 객체로 bike_m_casual 객체에 저장하시오.

# Q4. 주중과 주말을 구분하는 is_wend 변수를 bike_sub 객체에 생성하시오.

In [90]:
bike = pd.read_csv("DS_lv1/bike.csv")
bike_sub = bike[["datetime", "casual"]]
bike_sub.head(2)

              datetime  casual
0  2011-01-01 00:00:00       3
1  2011-01-01 01:00:00       8

In [101]:
bike_date = pd.to_datetime(bike_sub["datetime"])
bike_date

0       2011-01-01 00:00:00
1       2011-01-01 01:00:00
2       2011-01-01 02:00:00
3       2011-01-01 03:00:00
4       2011-01-01 04:00:00
                ...
10881   2012-12-19 19:00:00
10882   2012-12-19 20:00:00
10883   2012-12-19 21:00:00
10884   2012-12-19 22:00:00
10885   2012-12-19 23:00:00
Name: datetime, Length: 10886, dtype: datetime64[ns]

In [103]:
bike_date.dt.year

0        2011
1        2011
2        2011
3        2011
4        2011
         ...
10881    2012
10882    2012
10883    2012
10884    2012
10885    2012
Name: datetime, Length: 10886, dtype: int64

In [109]:
bike_sub["year"] = bike_date.dt.year
bike_sub["month"] = bike_date.dt.month
bike_sub["day"] = bike_date.dt.day
bike_sub["weekday"] = bike_date.dt.weekday
bike_sub

C:\Users\psk\anaconda3\lib\site-packages\pandas\core\frame.py:3607: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._set_item(key, value)

                  datetime  casual  year  month  day  weekday
0      2011-01-01 00:00:00       3  2011      1    1        5
1      2011-01-01 01:00:00       8  2011      1    1        5
2      2011-01-01 02:00:00       5  2011      1    1        5
3      2011-01-01 03:00:00       3  2011      1    1        5
4      2011-01-01 04:00:00       0  2011      1    1        5
...                    ...     ...   ...    ...  ...      ...
10881  2012-12-19 19:00:00       7  2012     12   19        2
10882  2012-12-19 20:00:00      10  2012     12   19        2
10883  2012-12-19 21:00:00       4  2012     12   19        2
10884  2012-12-19 22:00:00      12  2012     12   19        2
10885  2012-12-19 23:00:00       4  2012     12   19        2

[10886 rows x 6 columns]

In [111]:
bike_m_casual = bike_sub.groupby("month")["casual"].sum().reset_index()
bike_m_casual

    month  casual
0       1    7252
1       2    9297
2       3   25056
3       4   39813
4       5   41285
5       6   48574
6       7   50947
7       8   45870
8       9   45901
9      10   38087
10     11   25353
11     12   14700

In [115]:
mylist = []
for i in bike_sub["weekday"] :
    if(i==6 or i==5) :
        mylist.append("주말")
    else : 
        mylist.append("주중")
bike_sub["is_wend"] = mylist
bike_sub

C:\Users\psk\anaconda3\lib\site-packages\pandas\core\frame.py:3607: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._set_item(key, value)

                  datetime  casual  year  month  day  weekday is_wend
0      2011-01-01 00:00:00       3  2011      1    1        5      주말
1      2011-01-01 01:00:00       8  2011      1    1        5      주말
2      2011-01-01 02:00:00       5  2011      1    1        5      주말
3      2011-01-01 03:00:00       3  2011      1    1        5      주말
4      2011-01-01 04:00:00       0  2011      1    1        5      주말
...                    ...     ...   ...    ...  ...      ...     ...
10881  2012-12-19 19:00:00       7  2012     12   19        2      주중
10882  2012-12-19 20:00:00      10  2012     12   19        2      주중
10883  2012-12-19 21:00:00       4  2012     12   19        2      주중
10884  2012-12-19 22:00:00      12  2012     12   19        2      주중
10885  2012-12-19 23:00:00       4  2012     12   19        2      주중

[10886 rows x 7 columns]

In [121]:
import numpy as np
bike_sub["is_wend"] = np.where(bike_sub["weekday"].isin([5,6]), 1, 0) #isin : 이진값 - 만약 5,6이면 1, 아니면 0을 반환
#bike_sub["is_wend"] = np.where(bike_sub["weekday"]>= 5,1,0)
bike_sub["is_wend"] = (bike_sub["weekday"]>=5) + 0 #0을 더하면 true는 1로, false는 0으로 바뀐다.
#bike_sub["is_wend"] = (bike_sub["weekday"]>=5) * 1
bike_sub

C:\Users\psk\anaconda3\lib\site-packages\pandas\core\frame.py:3607: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._set_item(key, value)

                  datetime  casual  year  month  day  weekday  is_wend
0      2011-01-01 00:00:00       3  2011      1    1        5        1
1      2011-01-01 01:00:00       8  2011      1    1        5        1
2      2011-01-01 02:00:00       5  2011      1    1        5        1
3      2011-01-01 03:00:00       3  2011      1    1        5        1
4      2011-01-01 04:00:00       0  2011      1    1        5        1
...                    ...     ...   ...    ...  ...      ...      ...
10881  2012-12-19 19:00:00       7  2012     12   19        2        0
10882  2012-12-19 20:00:00      10  2012     12   19        2        0
10883  2012-12-19 21:00:00       4  2012     12   19        2        0
10884  2012-12-19 22:00:00      12  2012     12   19        2        0
10885  2012-12-19 23:00:00       4  2012     12   19        2        0

[10886 rows x 7 columns]

In [117]:
bike_sub.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10886 entries, 0 to 10885
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   datetime  10886 non-null  object
 1   casual    10886 non-null  int64
 2   year      10886 non-null  int64
 3   month     10886 non-null  int64
 4   day       10886 non-null  int64
 5   weekday   10886 non-null  int64
 6   is_wend   10886 non-null  object
dtypes: int64(5), object(2)
memory usage: 595.5+ KB

In [123]:
dia = pd.read_csv("DS_lv1/diamonds.csv")
dia.head(2)

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31

In [124]:
dia["color"].value_counts()

G    11292
E     9797
F     9542
H     8304
D     6775
I     5422
J     2808
Name: color, dtype: int64

In [125]:
pd.crosstab(dia["color"], dia["cut"])

cut    Fair  Good  Ideal  Premium  Very Good
color
D       163   662   2834     1603       1513
E       224   933   3903     2337       2400
F       312   909   3826     2331       2164
G       314   871   4884     2924       2299
H       303   702   3115     2360       1824
I       175   522   2093     1428       1204
J       119   307    896      808        678

In [127]:
pd.crosstab(dia["color"], dia["cut"], normalize = True)

cut        Fair      Good     Ideal   Premium  Very Good
color
D      0.003022  0.012273  0.052540  0.029718   0.028050
E      0.004153  0.017297  0.072358  0.043326   0.044494
F      0.005784  0.016852  0.070931  0.043215   0.040119
G      0.005821  0.016148  0.090545  0.054208   0.042621
H      0.005617  0.013014  0.057749  0.043752   0.033815
I      0.003244  0.009677  0.038802  0.026474   0.022321
J      0.002206  0.005692  0.016611  0.014980   0.012570

In [128]:
pd.crosstab(dia["color"], dia["cut"], normalize = 0)

cut        Fair      Good     Ideal   Premium  Very Good
color
D      0.024059  0.097712  0.418303  0.236605   0.223321
E      0.022864  0.095233  0.398387  0.238542   0.244973
F      0.032698  0.095263  0.400964  0.244288   0.226787
G      0.027807  0.077134  0.432519  0.258944   0.203595
H      0.036488  0.084538  0.375120  0.284200   0.219653
I      0.032276  0.096274  0.386020  0.263371   0.222058
J      0.042379  0.109330  0.319088  0.287749   0.241453

In [129]:
pd.crosstab(dia["color"], dia["cut"], normalize = 1)

cut        Fair      Good     Ideal   Premium  Very Good
color
D      0.101242  0.134937  0.131502  0.116235   0.125228
E      0.139130  0.190175  0.181105  0.169458   0.198643
F      0.193789  0.185283  0.177532  0.169023   0.179109
G      0.195031  0.177538  0.226625  0.212022   0.190283
H      0.188199  0.143090  0.144541  0.171126   0.150968
I      0.108696  0.106400  0.097118  0.103546   0.099652
J      0.073913  0.062576  0.041576  0.058589   0.056117

In [131]:
elec = pd.read_csv("DS_lv1/elec_load.csv")
elec.head(2)

,YEAR,MONTH,DAY,X1HR,X2HR,X3HR,X4HR,X5HR,X6HR,X7HR,...,X15HR,X16HR,X17HR,X18HR,X19HR,X20HR,X21HR,X22HR,X23HR,X24HR
0,2008,1,1,39638,37682,35801,34154,33068,32529,31982,...,28147,28313,28683,30921,32879,33038,34031,34684,37444,38160
1,2008,1,2,37425,35239,33568,32171,31616,31725,32575,...,38213,38132,38399,39796,40810,39980,40084,39630,42008,42150

In [133]:
elec.loc[:2, "X7HR":"X15HR"]

    X7HR   X8HR   X9HR  X10HR  X11HR  X12HR  X13HR  X14HR  X15HR
0  31982  30961  28323  27869  28172  28501  28202  28227  28147
1  32575  34090  35604  37967  38853  39103  36666  37691  38213
2  35563  36489  37243  39232  39720  39755  37143  37412  37355

In [134]:
elec.iloc[0, ].reset_index()

    index      0
0    YEAR   2008
1   MONTH      1
2     DAY      1
3    X1HR  39638
4    X2HR  37682
5    X3HR  35801
6    X4HR  34154
7    X5HR  33068
8    X6HR  32529
9    X7HR  31982
10   X8HR  30961
11   X9HR  28323
12  X10HR  27869
13  X11HR  28172
14  X12HR  28501
15  X13HR  28202
16  X14HR  28227
17  X15HR  28147
18  X16HR  28313
19  X17HR  28683
20  X18HR  30921
21  X19HR  32879
22  X20HR  33038
23  X21HR  34031
24  X22HR  34684
25  X23HR  37444
26  X24HR  38160

In [145]:
elec_melt = elec.melt(id_vars = ["YEAR", "MONTH", "DAY"])
elec_melt.head(2)

   YEAR  MONTH  DAY variable  value
0  2008      1    1     X1HR  39638
1  2008      1    2     X1HR  37425

In [154]:
elec_melt = elec_melt.rename(columns={'variable':'HOUR', 'value':'LOAD'})

#elec_melt.columns = ["YEAR","MONTH","DAY","HOUR","LOAD"]
elec_melt.head(2)

   YEAR  MONTH  DAY  HOUR   LOAD
0  2008      1    1  X1HR  39638
1  2008      1    2  X1HR  37425

In [155]:
elec_melt["HOUR"] = elec_melt["HOUR"].str.replace(pat = "X", repl = "")
elec_melt.head(2)

   YEAR  MONTH  DAY HOUR   LOAD
0  2008      1    1  1HR  39638
1  2008      1    2  1HR  37425

In [157]:
elec_pivot = elec_melt.pivot_table(index = ["YEAR", "MONTH", "DAY"], columns = ["HOUR"], values = ["LOAD"]).reset_index()
elec_pivot.head(2)

      YEAR MONTH DAY   LOAD                                            ...  \
HOUR                   10HR   11HR   12HR   13HR   14HR   15HR   16HR  ...
0     2008     1   1  27869  28172  28501  28202  28227  28147  28313  ...
1     2008     1   2  37967  38853  39103  36666  37691  38213  38132  ...


HOUR   23HR   24HR    2HR    3HR    4HR    5HR    6HR    7HR    8HR    9HR
0     37444  38160  37682  35801  34154  33068  32529  31982  30961  28323
1     42008  42150  35239  33568  32171  31616  31725  32575  34090  35604

[2 rows x 27 columns]